uhnp/src/DataProcessors/тн_ТрансформационныеКорректировкиСНепроведеннымиИсходнымиДокументами/тн_ТрансформационныеКорректировкиСНепроведеннымиИсходнымиДокументами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ТрансформационныеКорректировкиСНепроведеннымиИсходнымиДокументами</name>
  <comment>// Чекордина Ирина 30.09.2025 Выполнение задач №000055004</comment>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ОтражениеДокументовПоШаблонам/ОтражениеДокументовПоШаблонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеДокументовПоШаблонам</name>
  <resources>
    <name>УдалитьСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиДоЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтбора</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиПослеЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСторноПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтражения</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПоследнегоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериодаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроведениеОтменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеФоновымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </resources>
  <resources>
    <name>ОтраженоВСледующемПериоде</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособТрансляции</name>
    <type>
      <types>EnumRef.СпособыТрансляции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбработкаВыполнена</name>
    <type>
      <types>EnumRef.ДаНет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОперации</name>
    <type>
      <types>CatalogRef.ШаблоныТрансформационныхКорректировок</types>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трансляция</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ДокументыБД/ДокументыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаБД</name>
    <type>
      <types>EnumRef.ТипыДокументовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостояния</name>
    <type>
      <types>CatalogRef.ПеречисленияБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияЧерновик</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияНаУтверждении</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияУтвержден</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияОтклонен</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШаблонаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики1УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики2УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики3УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВНастройкахРеглмента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБланк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУниверсальныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШаблонТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастокУчета</name>
    <type>
      <types>CatalogRef.УчасткиУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостоянияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоОрганизациям</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСуммыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеБлокироватьРеквизитыПриУтверждении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НеОтражатьВУУ</name>
    <comment>// Гутарова Екатерина 03.05.2023 Выполнение задач №000045368</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласуетсяВДокументообороте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляСогласования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРеквизитыМатрицыПроцесса</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_ТрансформационныеКорректировкиСНепроведеннымиИсходнымиДокументами/Forms/Форма/Module.bsl
&НаКлиенте
Процедура НайтиНеПроведенныеИсходныеДокументы(Команда)
	
	ОчиститьСообщения();
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ТекстСообщения = СтрШаблон("Обработка начата: %1", ТекущаяДата()); 
	ТекстСообщения = СтрШаблон("Обработка начата: %1", ТекущаяДатаСервера());
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
	НайтиНеПроведенныеИсходныеДокументыНаСервере();
	
	//НАЧАЛО Блинова М.А. 29.04.2026 Выполнение задач №000057501
	//ТекстСообщения = СтрШаблон("Обработка завершена: %1", ТекущаяДата());
	ТекстСообщения = СтрШаблон("Обработка завершена: %1", ТекущаяДатаСервера());
	//КОНЕЦ Блинова М.А. 29.04.2026 Выполнение задач №000057501
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура НайтиНеПроведенныеИсходныеДокументыНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокументы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправочникДокументыБД.Ссылка КАК Ссылка,
	|	СправочникДокументыБД.Наименование КАК Наименование,
	|	СправочникДокументыБД.Синоним КАК Синоним,
	|	ВЫБОР
	|		КОГДА ШаблоныКорректировок.ДокументБД ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНастройки
	|ИЗ
	|	Справочник.ДокументыБД КАК СправочникДокументыБД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ШаблоныТрансформационныхКорректировок.ДокументБД КАК ДокументБД
	|		ИЗ
	|			Справочник.ШаблоныТрансформационныхКорректировок КАК ШаблоныТрансформационныхКорректировок) КАК ШаблоныКорректировок
	|		ПО СправочникДокументыБД.Ссылка = ШаблоныКорректировок.ДокументБД
	|ГДЕ
	|	НЕ СправочникДокументыБД.ОтсутствуетВКонфигурации
	|	И СправочникДокументыБД.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	|	И ВЫБОР
	|			КОГДА ШаблоныКорректировок.ДокументБД ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	ВыборкаВидыДок = Запрос.Выполнить().Выбрать();
	
	ЗапросИсходные = Новый Запрос;
	ЗапросИсходные.УстановитьПараметр("НачДата", Дата(2024,1,1));
	
	НомерСтроки = 0;
	Пока ВыборкаВидыДок.Следующий() Цикл
		
		ЗапросИсходные.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МСФО.Регистратор КАК ТрансформационнаяКорректировка,
		|	ВЫРАЗИТЬ(МСФО.Регистратор КАК Документ.ТрансформационнаяКорректировка).Представление КАК ТрансформационнаяКорректировкаПредставление,
		|	ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК ИсходныйДокумент,
		|	ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ.АвансовыйОтчет).Представление КАК ИсходныйДокументПредставление
		|ИЗ
		|	РегистрБухгалтерии.МСФО КАК МСФО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеДокументовПоШаблонам КАК ОтражениеДокументовПоШаблонам
		|		ПО (МСФО.Регистратор >= &НачДата)
		|			И МСФО.Регистратор = ОтражениеДокументовПоШаблонам.ДокументПервогоОтражения
		|			И (ВЫРАЗИТЬ(ОтражениеДокументовПоШаблонам.ИсходныйДокумент КАК Документ.АвансовыйОтчет).ПометкаУдаления)
		|			И НЕ ВЫРАЗИТЬ(МСФО.Регистратор КАК Документ.ТрансформационнаяКорректировка).Представление Есть NULL";
		ЗапросИсходные.Текст = СтрЗаменить(ЗапросИсходные.Текст,"АвансовыйОтчет",ВыборкаВидыДок.Наименование);
		
		ВыборкаИсходные = ЗапросИсходные.Выполнить().Выбрать();
		Пока ВыборкаИсходные.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;

			//ТекстСообщения = СтрШаблон("%1 - %2", ВыборкаИсходные.ИсходныйДокументПредставление, ВыборкаИсходные.ТрансформационнаяКорректировкаПредставление);
			//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			СтрокаТЗ = ТабДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ,ВыборкаИсходные);
			СтрокаТЗ.НомерСтроки = НомерСтроки;
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры
